In [3]:
import pandas as pd

In [6]:
chicago = pd.read_csv("input/chicago.csv")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [8]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null object
Employee Annual Salary    32062 non-null object
dtypes: object(4)
memory usage: 1002.0+ KB

In [9]:
chicago["Department"].count()

32062

In [11]:
chicago["Department"].nunique()

35

In [12]:
chicago["Department"] = chicago["Department"].astype("category")

In [13]:
chicago.info()
#size reduced by 20-25%(1002kb -> 784kb)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

### Common String methods- .len() , .upper(), .lower() and .tittle()

In [14]:
chicago = pd.read_csv("input/chicago.csv")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [15]:
"HELLO WORLD".lower()

'hello world'

In [20]:
"hello world".upper()

'HELLO WORLD'

In [19]:
"hello world".title()

'Hello World'

In [22]:
# "hello world".len() #throw error
len("hello world")

11

In [25]:
chicago["Department"].head(3)

0    WATER MGMNT
1         POLICE
2         POLICE
Name: Department, dtype: category
Categories (35, object): [ADMIN HEARNG, ANIMAL CONTRL, AVIATION, BOARD OF ELECTION, ..., STREETS & SAN, TRANSPORTN, TREASURER, WATER MGMNT]

In [27]:
#chicago["Department"].lower() # throws error
#because its a Series and this methods can be applied on only the strings
chicago["Department"].str.lower().head(3)

0    water mgmnt
1         police
2         police
Name: Department, dtype: object

In [28]:
chicago["Department"].str.upper().head(3)

0    WATER MGMNT
1         POLICE
2         POLICE
Name: Department, dtype: object

In [30]:
chicago["Department"].str.lower().str.upper().head(3)

0    WATER MGMNT
1         POLICE
2         POLICE
Name: Department, dtype: object

In [31]:
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [35]:
#chicago["Name"].title() throws error
chicago["Name"].str.title().head(3)

0      Aaron,  Elvia J
1    Aaron,  Jeffery M
2       Aaron,  Karina
Name: Name, dtype: object

In [38]:
chicago["Name"] = chicago["Name"].str.title()
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    Aaron,  Elvia J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
2     Aaron,  Karina    POLICE OFFICER       POLICE              $84450.00

In [39]:
chicago["Position Title"] = chicago["Position Title"].str.title()
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    Aaron,  Elvia J  Water Rate Taker  WATER MGMNT              $90744.00
1  Aaron,  Jeffery M    Police Officer       POLICE              $84450.00
2     Aaron,  Karina    Police Officer       POLICE              $84450.00

In [42]:
# chicago["Name"].len() #throws error
len(chicago["Name"])
#returns total no. of rows

32063

In [44]:
chicago["Name"].str.len().head(3)

0    15.0
1    17.0
2    14.0
Name: Name, dtype: float64

### The .str.replace() method

In [72]:
chicago = pd.read_csv("input/chicago.csv")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [73]:
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [74]:
chicago.dropna(how = "all",inplace=True)

In [75]:
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [76]:
"hello world".replace("l","!")

'he!!o wor!d'

In [77]:
chicago["Department"].head()

0         WATER MGMNT
1              POLICE
2              POLICE
3    GENERAL SERVICES
4         WATER MGMNT
Name: Department, dtype: category
Categories (35, object): [ADMIN HEARNG, ANIMAL CONTRL, AVIATION, BOARD OF ELECTION, ..., STREETS & SAN, TRANSPORTN, TREASURER, WATER MGMNT]

In [78]:
chicago["Department"] = chicago["Department"].str.replace("MGMNT","MANAGEMENT")
chicago["Department"].head()

0    WATER MANAGEMENT
1              POLICE
2              POLICE
3    GENERAL SERVICES
4    WATER MANAGEMENT
Name: Department, dtype: object

In [93]:
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$","").astype("float")

In [80]:
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,84450.0
2,"AARON, KARINA",POLICE OFFICER,POLICE,84450.0

In [83]:
chicago["Employee Annual Salary"].mean() # average salary

80204.178633899

In [84]:
chicago["Employee Annual Salary"].std() #standard deviation

25098.329867510587

In [85]:
chicago["Employee Annual Salary"].sum() #total income form chicago

2571506375.36

In [96]:
chicago["Employee Annual Salary"].nlargest(3)

8184     300000.0
7954     216210.0
25532    202728.0
Name: Employee Annual Salary, dtype: float64

In [86]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null object
Employee Annual Salary    32062 non-null float64
dtypes: float64(1), object(3)
memory usage: 1.2+ MB

In [89]:
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].astype("object")
chicago["Department"] = chicago["Department"].astype("category")

In [90]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 1.0+ MB

### Filtering with String methods

In [99]:
chicago = pd.read_csv("input/chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [100]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 1.0+ MB

In [104]:
mask = chicago["Position Title"].str.contains("WATER")
chicago[mask].head(3)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
554,"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MGMNT,$102440.00
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MGMNT,$82044.00

In [108]:
mask = chicago["Position Title"].str.startswith("WATER")
chicago[mask].head(3)

                  Name    Position Title   Department Employee Annual Salary
0      AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
671    ANDER,  PERRY A  WATER CHEMIST II  WATER MGMNT              $82044.00
1054  ASHLEY,  KARMA T  WATER CHEMIST II  WATER MGMNT              $82044.00

In [110]:
mask = chicago["Position Title"].str.endswith("IST")
chicago[mask].head(3)

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",PSYCHIATRIST,HEALTH,$99840.00
308,"ALARCON, LUIS J",LOAN PROCESSING SPECIALIST,COMMUNITY DEVELOPMENT,$81948.00
422,"ALLAIN, CAROLYN",SENIOR TELECOMMUNICATIONS SPECIALIST,DoIT,$89880.00

### The .strip(), .lstrip() and .rstrip() methods

In [111]:
chicago = pd.read_csv("input/chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [112]:
"  Hello world  ".strip()

'Hello world'

In [113]:
"  Hello world  ".lstrip()

'Hello world  '

In [114]:
"  Hello world  ".rstrip()

'  Hello world'

In [119]:
chicago["Name"] = chicago["Name"].str.lstrip()

In [120]:
chicago["Name"] = chicago["Name"].str.rstrip()

In [121]:
chicago["Position Title"] = chicago["Position Title"].str.strip()

In [123]:
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

### Strings methods on Index and Column

In [124]:
chicago = pd.read_csv("input/chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [128]:
chicago.set_index("Name",inplace=True)

In [129]:
chicago.head(3)

                     Position Title   Department Employee Annual Salary
Name
AARON,  ELVIA J    WATER RATE TAKER  WATER MGMNT              $90744.00
AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
AARON,  KARINA       POLICE OFFICER       POLICE              $84450.00

In [134]:
chicago.index = chicago.index.str.strip().str.title()

In [135]:
chicago.head(3)

                     Position Title   Department Employee Annual Salary
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

In [136]:
chicago.columns

Index(['Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [143]:
chicago.columns = chicago.columns.str.upper().str.replace(" ","_")

In [144]:
chicago.head(3)

                     POSITION_TITLE   DEPARTMENT EMPLOYEE_ANNUAL_SALARY
Name
Aaron,  Elvia J    WATER RATE TAKER  WATER MGMNT              $90744.00
Aaron,  Jeffery M    POLICE OFFICER       POLICE              $84450.00
Aaron,  Karina       POLICE OFFICER       POLICE              $84450.00

### Split strings by character with .str.split() method

In [175]:
chicago = pd.read_csv("input/chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.tail(3)

,Name,Position Title,Department,Employee Annual Salary
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [176]:
"Hello World".split() # by default split by a single space ' '

['Hello', 'World']

In [177]:
"Hello_World".split("_")

['Hello', 'World']

In [178]:
chicago["FirstName"] = chicago["Name"].str.split(",").str.get(0)

In [179]:
chicago["LastName"] = chicago["Name"].str.split(",").str.get(1)

In [180]:
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary,FirstName,LastName
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA

In [181]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 6 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
FirstName                 32062 non-null object
LastName                  32062 non-null object
dtypes: category(1), object(5)
memory usage: 1.5+ MB

In [182]:
del chicago["Name"]

In [183]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 5 columns):
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
FirstName                 32062 non-null object
LastName                  32062 non-null object
dtypes: category(1), object(4)
memory usage: 1.3+ MB

In [184]:
chicago.head()

,Position Title,Department,Employee Annual Salary,FirstName,LastName
0,WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,POLICE OFFICER,POLICE,$84450.00,AARON,KARINA
3,CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R
4,CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M

In [192]:
chicago["Position Title"].str.split().str.get(0).value_counts().head(3)
#most common first word among chicago job titles

POLICE             10856
FIREFIGHTER-EMT     1509
SERGEANT            1186
Name: Position Title, dtype: int64

### More Practice with split method

In [207]:
chicago = pd.read_csv("input/chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [209]:
chicago["Name"].str.split(",").str.get(0).value_counts().head(3)
#most common first name among employee of chicago

WILLIAMS    293
JOHNSON     244
SMITH       241
Name: Name, dtype: int64

In [217]:
chicago["Name"].str.split(",").str.get(1).str.split().str.get(0).value_counts().head(3)
#most common last name among employee of chicago

MICHAEL    1153
JOHN        899
JAMES       676
Name: Name, dtype: int64

### The expand and n Parameters of the str.split() method

In [218]:
chicago = pd.read_csv("input/chicago.csv").dropna(how = "all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [223]:
chicago["Name"].str.split(",").head()

0        [AARON,   ELVIA J]
1      [AARON,   JEFFERY M]
2         [AARON,   KARINA]
3    [AARON,   KIMBERLEI R]
4    [ABAD JR,   VICENTE M]
Name: Name, dtype: object

In [225]:
chicago["Name"].str.split(",",expand = True).head(3)

       0            1
0  AARON      ELVIA J
1  AARON    JEFFERY M
2  AARON       KARINA

In [226]:
chicago[["FirstName","LastName"]]= chicago["Name"].str.split(",",expand = True)

In [227]:
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary,FirstName,LastName
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA